# Integraci√≥n de resultados de MySQL Connector/Python con Pandas

**üö®NOTA IMPORTANTE: üö®**

Al comenzar esta lecci√≥n e ir ejecutando las diferentes celdas de Python, te recomendamos que tengas abierto tambien MySQL para ir viendo paso a paso como se van ejecutando las ordenes desde este notebook en MySQL.üòä

**¬øQu√© es Pandas?**

Pandas es una de las bibliotecas m√°s poderosas y populares de Python cuando se trata de manipulaci√≥n y an√°lisis de datos. Es la herramienta perfecta para trabajar con datos estructurados en forma de tablas, como los que encontramos en bases de datos SQL o incluso en archivos de Excel (y otros formatos como JSON). Con Pandas, no solo puedes cargar y limpiar datos, sino tambi√©n procesarlos para obtener informaci√≥n valiosa y combinarlos con otras fuentes de datos de manera eficiente.

La estructura principal con la que trabajar√°s en Pandas se llama *DataFrame*. En esta lecci√≥n, aprender√°s c√≥mo importar datos desde una base de datos MySQL a un *DataFrame* de Pandas, y tambi√©n exploraremos algunas operaciones b√°sicas que te ayudar√°n a comenzar. M√°s adelante, profundizaremos en todo lo que Pandas tiene para ofrecerte, pero por ahora, nuestro objetivo es que te familiarices con la integraci√≥n entre MySQL Connector/Python y Pandas.

¬°Vamos a sumergirnos en el mundo de Pandas y ver c√≥mo podemos manipular los datos de manera sencilla y efectiva! üöÄ

## Crear un DataFrame de Pandas desde una sentencia SQL:

No olvides que cada vez que queremos trabajar con librerias, en el caso que no se hayan cargado previamente debemos hacerlo, asi que como primer paso vamos a importar las librerias necesarias para poder trabajar con MySQL y Python.

In [1]:
# Importar librer√≠a para la conexi√≥n con MySQL
# -----------------------------------------------------------------------
import mysql.connector
from mysql.connector import errorcode

Y en este caso, como usaremos la libreria "Pandas" debemos importarla.

In [2]:
# primero tenemos que importar la librer√≠a

import pandas as pd  # El "as" es como darle un alias a la biblioteca que voy a usar...te recuerda al AS de las query de SQL?

Como mencionamos anteriormente, Pandas ofrece una integraci√≥n sencilla con una variedad de formatos de archivo y fuentes de datos, como archivos CSV, Excel, JSON y bases de datos SQL, entre otros. Por ejemplo, para cargar datos desde una base de datos SQL, puedes ejecutar el siguiente fragmento de c√≥digo, que incluye una llamada al constructor de DataFrames:

In [4]:
# hacemos la conexi√≥n con el servidor
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1',
                              database='tienda',
                              auth_plugin ='mysql_native_password')

# iniciamos el cursor
mycursor = cnx.cursor()

# ejecutamos nuestra query
mycursor.execute("SELECT * FROM employees")

# le decimos que nos devuelva todos los resultados y los almacenamos en una variable llamada myresult
myresult = mycursor.fetchall()

#Creamos un dataframe con los resultados de la consulta SQL almacenados en myresult. Si os fij√°is le estamos pasando un par√°metro llamado "columns" donde estamos especificando cu√°les son las columnas de lo que ser√° nuestro dataframe
df = pd.DataFrame(myresult, columns = ['ID', 'Nombre', 'Apellido','Email','Telefono','Direccion','Ciudad','Pais'])

#Cerramos la conexion
cnx.close()

Excelente! ya tenemos nuestra informacion consultada en la variable "df" (veras en muchos lugares el "df" como variable que se uas para decir que es un DataFrame). Ahora lo ideal seria ver esa informacion no?

In [5]:
# mostramos las primeras filas del Dataframe usando el m√©todo .head()

df.head()

,ID,Nombre,Apellido,Email,Telefono,Direccion,Ciudad,Pais
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)

Otra opci√≥n m√°s directa para ver los resultados de nuestra query en un DataFrame consiste en encargarle a Pandas directamente la ejecuci√≥n de la consulta SQL. Para ello usaremos el m√©todo *read_sql_query()* como vemos a continuaci√≥n:

In [6]:
# realizamos la conexi√≥n con el servidor
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1',
                              database='tienda',
                              auth_plugin ='mysql_native_password')


# escribimos nuestra query
sql = "SELECT * FROM employees"

# utilizamos el m√©todo pd.read_sql_query() para convertir los resultados de nuestra query en un DataFrame que podamos ver de forma amigable en Python
df1 = pd.read_sql_query(sql, cnx)

#Cerramos la conexi√≥n
cnx.close()

C:\Users\noeli\AppData\Local\Temp\ipykernel_14952\1224508396.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df1 = pd.read_sql_query(sql, cnx)

In [7]:
# mostramos las primeras filas del Dataframe usando el m√©todo .head()

df1.head()

,employee_number,last_name,first_name,extension,email,office_code,reports_to,job_title
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)

## Guardado de datos:

Una vez que tenemos nuestro Dataframe podemos guardarlo en diferentes formatos. En este caso lo vamos a guardar en *csv*:

In [8]:
df1.to_csv("fichero.csv")

Para poder guardarlo, usamos *.to_csv()* y especificamos el nombre de nuestro fichero con la extensi√≥n. M√°s adelante aprenderemos c√≥mo guardar los datos en diferentes formatos. Debes saber que se estara guardando en el directorio donde estas ejecutando este notebook, por ejemplo si estas en documentos/mi_carpeta entonces se encontrara ahi dentro.

## Intro Pandas

Pandas, la biblioteca de Python dedicada a la gesti√≥n y an√°lisis de datos, se destaca por sus numerosas caracter√≠sticas fundamentales:

- Introduce innovadoras estructuras de datos basadas en los arrays de NumPy, enriqueci√©ndolas con capacidades avanzadas.

- Facilita la lectura y escritura de datos en formatos populares como CSV, Excel y bases de datos SQL, simplificando la manipulaci√≥n de datos externos.

- Proporciona una accesibilidad excepcional a los datos a trav√©s de √≠ndices y etiquetas para filas y columnas, simplificando la navegaci√≥n en conjuntos de datos complejos.

- Ofrece una amplia gama de m√©todos para reorganizar, dividir y fusionar conjuntos de datos, lo que agiliza la manipulaci√≥n de datos seg√∫n tus necesidades.

- Permite un manejo eficiente de series temporales, lo que resulta esencial para el an√°lisis de datos relacionados con el tiempo.

En este apartado vamos a aprender a utilizar m√©todos como head(), tail(), describe(), entre otros, para obtener informaci√≥n relevante de los datos. Estos m√©todos te permitir√°n examinar r√°pidamente la estructura de tus datos y comprender sus estad√≠sticas clave.


Empezamos por importar las librer√≠as que vamos a usar:

### Principales m√©todos de Pandas:

- M√©todos para exploraci√≥n b√°sica del *DataFrame*: 

    - `.head()`
    - `.tail()`
    - `.sample()`
    - `.describe()`
    - `.duplicated()`
    - `.isnull()`
    - `.isna()`
    - `.info()`
    - `.columns`

- `.head()`

Muestra las primeras l√≠neas de nuestro Dataframe. Por defecto nos ense√±a 5.

In [9]:
df.head()

,ID,Nombre,Apellido,Email,Telefono,Direccion,Ciudad,Pais
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)

In [10]:
# si queremos ver un n√∫mero diferente de filas, se lo podemos especificar

df.head(7) # Le digo que solo quiero las 7 primeras

,ID,Nombre,Apellido,Email,Telefono,Direccion,Ciudad,Pais
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)
5,1143,Bow,Anthony,x5428,abow@classicmodelcars.com,1,1056.0,Sales Manager (NA)
6,1165,Jennings,Leslie,x3291,ljennings@classicmodelcars.com,1,1143.0,Sales Rep

- `.tail()`

Devuelve las √∫ltimas 5 filas del Dataframe. Al igual que con `.head()`, podemos especificar un n√∫mero diferente.

In [11]:
df.tail()

,ID,Nombre,Apellido,Email,Telefono,Direccion,Ciudad,Pais
18,1612,Marsh,Peter,x102,pmarsh@classicmodelcars.com,6,1088.0,Sales Rep
19,1619,King,Tom,x103,tking@classicmodelcars.com,6,1088.0,Sales Rep
20,1621,Nishi,Mami,x101,mnishi@classicmodelcars.com,5,1056.0,Sales Rep
21,1625,Kato,Yoshimi,x102,ykato@classicmodelcars.com,5,1621.0,Sales Rep
22,1702,Gerard,Martin,x2312,mgerard@classicmodelcars.com,4,1102.0,Sales Rep

In [12]:
# Al igual que en .head() si queremos ver un n√∫mero diferente de filas, se lo podemos especificar

df.tail(7) # Le digo que solo quiero las 7 ultimas

,ID,Nombre,Apellido,Email,Telefono,Direccion,Ciudad,Pais
16,1504,Jones,Barry,x102,bjones@classicmodelcars.com,7,1102.0,Sales Rep
17,1611,Fixter,Andy,x101,afixter@classicmodelcars.com,6,1088.0,Sales Rep
18,1612,Marsh,Peter,x102,pmarsh@classicmodelcars.com,6,1088.0,Sales Rep
19,1619,King,Tom,x103,tking@classicmodelcars.com,6,1088.0,Sales Rep
20,1621,Nishi,Mami,x101,mnishi@classicmodelcars.com,5,1056.0,Sales Rep
21,1625,Kato,Yoshimi,x102,ykato@classicmodelcars.com,5,1621.0,Sales Rep
22,1702,Gerard,Martin,x2312,mgerard@classicmodelcars.com,4,1102.0,Sales Rep

- `.sample()`

Muestra filas aleatorias. Por defecto nos devuelve 1, pero tambi√©n le podemos dar un valor diferente.

In [13]:
df.sample()

,ID,Nombre,Apellido,Email,Telefono,Direccion,Ciudad,Pais
13,1370,Hernandez,Gerard,x2028,ghernande@classicmodelcars.com,4,1102.0,Sales Rep

In [14]:
df.sample(4) # Pidi√©ndole 4 registros de manera aleatoria

,ID,Nombre,Apellido,Email,Telefono,Direccion,Ciudad,Pais
17,1611,Fixter,Andy,x101,afixter@classicmodelcars.com,6,1088.0,Sales Rep
15,1501,Bott,Larry,x2311,lbott@classicmodelcars.com,7,1102.0,Sales Rep
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)
8,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143.0,Sales Rep

- `describe()`

Nos devuelve un *DataFrame* con un resumen de los principales estad√≠sticos (media, mediana, desviac√≥n est√°ndar etc.) de nuestras **columnas num√©ricas**.

In [15]:
df.describe()

                ID       Ciudad
count    23.000000    22.000000
mean   1335.391304  1117.409091
std     223.565475   120.173549
min    1002.000000  1002.000000
25%    1154.000000  1064.000000
50%    1323.000000  1102.000000
75%    1557.500000  1143.000000
max    1702.000000  1621.000000

Si queremos ver el `.describe()`de las variables categ√≥ricas, tenemos que incluir `include = "object"`. Podemos ver que nos devuelve diferentes estad√≠sticas que para las num√©ricas.

- count: El n√∫mero total de valores no nulos en la columna.
- unique: El n√∫mero de valores √∫nicos en la columna.
- top: El valor m√°s frecuente en la columna.
- freq: La frecuencia del valor m√°s com√∫n (el n√∫mero de veces que aparece).

In [17]:
df.describe(include="object")

,Nombre,Apellido,Email,Telefono,Direccion,Pais
count,23,23,23,23,23,23
unique,19,21,20,22,7,7
top,Patterson,Gerard,x102,jfirrelli@classicmodelcars.com,1,Sales Rep
freq,3,2,3,2,6,17

- `duplicated()`

Devuelve una Serie booleana que indica si cada fila es un duplicado de una fila previamente vista.

In [18]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
dtype: bool

Si queremos ver el n√∫mero de filas duplicadas de nuestro Dataframe tenemos que usar `.sum()`

In [19]:
df.duplicated().sum()

0

- `isnull()` / - `isna()`:

Estos son los m√©todos para ver los valores nulos que tenemos en nuestros datos, podemos usar cualquiera de ellos ya que hacen lo mismo.

Nos devuelve un booleano con los valores que faltan en nuestro DataFrame.

In [20]:
df.isnull()

       ID  Nombre  Apellido  Email  Telefono  Direccion  Ciudad   Pais
0   False   False     False  False     False      False    True  False
1   False   False     False  False     False      False   False  False
2   False   False     False  False     False      False   False  False
3   False   False     False  False     False      False   False  False
4   False   False     False  False     False      False   False  False
5   False   False     False  False     False      False   False  False
6   False   False     False  False     False      False   False  False
7   False   False     False  False     False      False   False  False
8   False   False     False  False     False      False   False  False
9   False   False     False  False     False      False   False  False
10  False   False     False  False     False      False   False  False
11  False   False     False  False     False      False   False  False
12  False   False     False  False     False      False   False  False
13  False   False     False  False     False      False   False  False
14  False   False     False  False     False      False   False  False
15  False   False     False  False     False      False   False  False
16  False   False     False  False     False      False   False  False
17  False   False     False  False     False      False   False  False
18  False   False     False  False     False      False   False  False
19  False   False     False  False     False      False   False  False
20  False   False     False  False     False      False   False  False
21  False   False     False  False     False      False   False  False
22  False   False     False  False     False      False   False  False

Al igual que con los duplicados, podemos usar `.sum()` para poder entender mejor el resultado. Ahora nos devuelve el n√∫mero de valores nulos por cada columna.

In [21]:
df.isnull().sum()

ID           0
Nombre       0
Apellido     0
Email        0
Telefono     0
Direccion    0
Ciudad       1
Pais         0
dtype: int64

- `info()`

El m√©todo `info()` proporciona un peque√±o resumen que incluye:

- El total de columnas en el DataFrame.
- Los nombres de las columnas.
- La cantidad de valores no nulos en cada columna.
- El tipo de datos de cada columna en el DataFrame.

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         23 non-null     int64
 1   Nombre     23 non-null     object
 2   Apellido   23 non-null     object
 3   Email      23 non-null     object
 4   Telefono   23 non-null     object
 5   Direccion  23 non-null     object
 6   Ciudad     22 non-null     float64
 7   Pais       23 non-null     object
dtypes: float64(1), int64(1), object(6)
memory usage: 1.6+ KB

- `columns`

Nos muestra el nombre de las columnas de nuestro *DataFrame* .

In [23]:
df.columns

Index(['ID', 'Nombre', 'Apellido', 'Email', 'Telefono', 'Direccion', 'Ciudad',
       'Pais'],
      dtype='object')

¬°Gran trabajo!üëç Hemos llegado al final de esta lecci√≥n sobre la integraci√≥n de Pandas con MySQL. Ahora ya sabes c√≥mo conectar una base de datos MySQL con Python y c√≥mo traer esos datos a un *DataFrame* de Pandas para analizarlos de manera m√°s eficiente. üöÄ

Pandas es una herramienta incre√≠blemente poderosa, y lo que hemos visto hoy es solo una peque√±a introducci√≥n. En futuras lecciones, profundizaremos m√°s en las capacidades de Pandas para la manipulaci√≥n y an√°lisis de datos.

Recuerda que dominar estas herramientas llevar√° tiempo, pero con cada paso que das, est√°s construyendo una base s√≥lida para trabajar con grandes vol√∫menes de datos de manera efectiva.

¬°Sigue practicando y nos vemos en la pr√≥xima lecci√≥n! üí°